Documents/упРаспределениеПрямыхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упРаспределениеПрямыхРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упДоходыРасходыПредприятия</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРегламентнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРаспределенияЗатратНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРаспределенияЗатратОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоРаспределенияПрямыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРаспределенияПрямыхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасходыПоРейсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВариантыРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходыПоТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВариантыРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходыФинансовыйРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расходы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВариантыРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеРегистраРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаПеревозку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеРегистраРасходыНаТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеРегистраДоходыРасходыПредприятия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расходы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упСпособыВводаФактическихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыВводаФактическихРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходыПоОдномуРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоНесколькимРейсам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбобщенныеРасходыПоНесколькимРейсам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыЗаПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упРаспределениеПрямыхРасходов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
		ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
		упРаспределениеРасходов.ЗаполнитьДоходыРасходы(ЭтотОбъект, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРасходы(ЗаполнитьРасходыПоРейсам = Истина, ЗаполнитьРасходыПоТС = Истина, ЗаполнитьРасходыФинансовыйРезультат = Истина, сткПараметры = Неопределено) Экспорт
	
	РеквизитыОбъекта = Новый Структура("Дата,
								|ПериодРаспределенияЗатратНачало,
								|ПериодРаспределенияЗатратОкончание,
								|Валюта,
								|ПравилоРаспределенияПрямыхРасходов, 
								|Организация, 										
								|Подразделение,
								|ДанныеРегистраРасходы,
								|ДанныеРегистраРасходыНаТС,
								|ДанныеРегистраДоходыРасходыПредприятия,
								|НаправлениеДеятельности");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("АналитическийРазрез", Неопределено);
	
	ВедетсяВалютныйУчет	   = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет",                 ВедетсяВалютныйУчет);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоРейсам",            ЗаполнитьРасходыПоРейсам);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоТС",                ЗаполнитьРасходыПоТС);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыФинансовыйРезультат", ЗаполнитьРасходыФинансовыйРезультат);
	
	Отказ = Ложь;
	упРаспределениеРасходов.ЗаполнитьПрямыеРасходы(ДополнительныеСвойства, ЭтотОбъект.Ссылка, РеквизитыОбъекта, Отказ, сткПараметры);
	
КонецПроцедуры

Процедура РаспределитьРасходы(ЗаполнитьРасходыПоРейсам = Истина, ЗаполнитьРасходыПоТС = Истина, ЗаполнитьРасходыФинансовыйРезультат = Истина, сткПараметры = Неопределено) Экспорт
	
	РеквизитыОбъекта = Новый Структура("Дата,
								|ПериодРаспределенияЗатратНачало,
								|ПериодРаспределенияЗатратОкончание,
								|Валюта,
								|ПравилоРаспределенияПрямыхРасходов, 
								|Организация, 										
								|Подразделение,
								|ДанныеРегистраРасходы,
								|ДанныеРегистраРасходыНаТС,
								|ДанныеРегистраДоходыРасходыПредприятия,
								|РасходыПоРейсам,
								|РасходыПоТС,
								|РасходыФинансовыйРезультат,
								|НаправлениеДеятельности");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("АналитическийРазрез", Неопределено);
	
	ВедетсяВалютныйУчет	   = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет",                 ВедетсяВалютныйУчет);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоРейсам",            ЗаполнитьРасходыПоРейсам);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоТС",                ЗаполнитьРасходыПоТС);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыФинансовыйРезультат", ЗаполнитьРасходыФинансовыйРезультат);
	
	Отказ = Ложь;
	упРаспределениеРасходов.РаспределитьПрямыеРасходы(ДополнительныеСвойства, ЭтотОбъект.Ссылка, РеквизитыОбъекта, Отказ, сткПараметры);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	РеквизитыОбъекта = Новый Структура("Дата,
								|Организация,
								|Валюта,
								|Подразделение,
								|СтатьяРасходов");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("НаправлениеДеятельности", Справочники.упНаправленияДеятельности.ПустаяСсылка());
	РеквизитыОбъекта.Вставить("СпособВводаРасходов",     Перечисления.упСпособыВводаФактическихРасходов.РасходыПоНесколькимРейсам);
	РеквизитыОбъекта.Вставить("Дата",                    ПериодРаспределенияЗатратОкончание);
	РеквизитыОбъекта.Вставить("АналитическийРазрез",     Неопределено);
	

	// Формируются фактические расходы
	упРаспределениеРасходов.СформироватьРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
